grevaillot/svd_tools/headers/STM32H7x7_CM4/i2c1.h
/** @defgroup i2c1_i2c_cr2 I2CCR2 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK.
@{*/

/** I2C1_I2C_CR2_PECBYTE Packet error checking byte This bit is set by software, and cleared by hardware when the PEC is transferred, or when a STOP condition or an Address matched is received, also when PE=0. Note: Writing 0 to this bit has no effect. This bit has no effect when RELOAD is set. This bit has no effect is slave mode when SBC=0. If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C1_I2C_CR2_PECBYTE		(1 << 26)
/** I2C1_I2C_CR2_AUTOEND Automatic end mode (master mode) This bit is set and cleared by software. Note: This bit has no effect in slave mode or when the RELOAD bit is set. **/
#define I2C1_I2C_CR2_AUTOEND		(1 << 25)
/** I2C1_I2C_CR2_RELOAD NBYTES reload mode This bit is set and cleared by software. **/
#define I2C1_I2C_CR2_RELOAD		(1 << 24)

#define I2C1_I2C_CR2_NBYTES_SHIFT		16
#define I2C1_I2C_CR2_NBYTES_MASK		0xff
/** @defgroup i2c1_i2c_cr2_nbytes NBYTES Number of bytes The number of bytes to be transmitted/received is programmed there. This field is dont care in slave mode with SBC=0. Note: Changing these bits when the START bit is set is not allowed.
@{*/
/**@}*/

/** I2C1_I2C_CR2_NACK NACK generation (slave mode) The bit is set by software, cleared by hardware when the NACK is sent, or when a STOP condition or an Address matched is received, or when PE=0. Note: Writing 0 to this bit has no effect. This bit is used in slave mode only: in master receiver mode, NACK is automatically generated after last byte preceding STOP or RESTART condition, whatever the NACK bit value. When an overrun occurs in slave receiver NOSTRETCH mode, a NACK is automatically generated whatever the NACK bit value. When hardware PEC checking is enabled (PECBYTE=1), the PEC acknowledge value does not depend on the NACK value. **/
#define I2C1_I2C_CR2_NACK		(1 << 15)
/** I2C1_I2C_CR2_STOP Stop generation (master mode) The bit is set by software, cleared by hardware when a Stop condition is detected, or when PE = 0. In Master Mode: Note: Writing 0 to this bit has no effect. **/
#define I2C1_I2C_CR2_STOP		(1 << 14)
/** I2C1_I2C_CR2_START Start generation This bit is set by software, and cleared by hardware after the Start followed by the address sequence is sent, by an arbitration loss, by a timeout error detection, or when PE = 0. It can also be cleared by software by writing 1 to the ADDRCF bit in the I2C_ICR register. If the I2C is already in master mode with AUTOEND = 0, setting this bit generates a Repeated Start condition when RELOAD=0, after the end of the NBYTES transfer. Otherwise setting this bit will generate a START condition once the bus is free. Note: Writing 0 to this bit has no effect. The START bit can be set even if the bus is BUSY or I2C is in slave mode. This bit has no effect when RELOAD is set. **/
#define I2C1_I2C_CR2_START		(1 << 13)
/** I2C1_I2C_CR2_HEAD10R 10-bit address header only read direction (master receiver mode) Note: Changing this bit when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_HEAD10R		(1 << 12)
/** I2C1_I2C_CR2_ADD10 10-bit addressing mode (master mode) Note: Changing this bit when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_ADD10		(1 << 11)
/** I2C1_I2C_CR2_RD_WRN Transfer direction (master mode) Note: Changing this bit when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_RD_WRN		(1 << 10)
/** I2C1_I2C_CR2_SADD9 Slave address bit 9:8 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits are dont care In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 9:8 of the slave address to be sent Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD9		(1 << 9)
/** I2C1_I2C_CR2_SADD8 Slave address bit 9:8 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits are dont care In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 9:8 of the slave address to be sent Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD8		(1 << 8)
/** I2C1_I2C_CR2_SADD7 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD7		(1 << 7)
/** I2C1_I2C_CR2_SADD6 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD6		(1 << 6)
/** I2C1_I2C_CR2_SADD5 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD5		(1 << 5)
/** I2C1_I2C_CR2_SADD4 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD4		(1 << 4)
/** I2C1_I2C_CR2_SADD3 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD3		(1 << 3)
/** I2C1_I2C_CR2_SADD2 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD2		(1 << 2)
/** I2C1_I2C_CR2_SADD1 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD1		(1 << 1)
/** I2C1_I2C_CR2_SADD0 Slave address bit 0 (master mode) In 7-bit addressing mode (ADD10 = 0): This bit is dont care In 10-bit addressing mode (ADD10 = 1): This bit should be written with bit 0 of the slave address to be sent Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C1_I2C_CR2_SADD0		(1 << 0)

/**@}*/

/** @defgroup i2c1_i2c_oar1 I2COAR1 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK.
@{*/

/** I2C1_I2C_OAR1_OA1EN Own Address 1 enable **/
#define I2C1_I2C_OAR1_OA1EN		(1 << 15)
/** I2C1_I2C_OAR1_OA1MODE Own Address 1 10-bit mode Note: This bit can be written only when OA1EN=0. **/
#define I2C1_I2C_OAR1_OA1MODE		(1 << 10)

#define I2C1_I2C_OAR1_OA1_SHIFT		0
#define I2C1_I2C_OAR1_OA1_MASK		0x3ff
/** @defgroup i2c1_i2c_oar1_oa1 OA1 Interface address 7-bit addressing mode: dont care 10-bit addressing mode: bits 9:8 of address Note: These bits can be written only when OA1EN=0. OA1[7:1]: Interface address Bits 7:1 of address Note: These bits can be written only when OA1EN=0. OA1[0]: Interface address 7-bit addressing mode: dont care 10-bit addressing mode: bit 0 of address Note: This bit can be written only when OA1EN=0.
@{*/
/**@}*/


/**@}*/

