grevaillot/svd_tools/headers/STM32H7x7_CM4/i2c1.h
/** @defgroup i2c1_i2c_icr I2CICR Access: No wait states
@{*/

/** I2C1_I2C_ICR_ALERTCF Alert flag clear Writing 1 to this bit clears the ALERT flag in the I2C_ISR register. Note: If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C1_I2C_ICR_ALERTCF		(1 << 13)
/** I2C1_I2C_ICR_TIMOUTCF Timeout detection flag clear Writing 1 to this bit clears the TIMEOUT flag in the I2C_ISR register. Note: If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C1_I2C_ICR_TIMOUTCF		(1 << 12)
/** I2C1_I2C_ICR_PECCF PEC Error flag clear Writing 1 to this bit clears the PECERR flag in the I2C_ISR register. Note: If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C1_I2C_ICR_PECCF		(1 << 11)
/** I2C1_I2C_ICR_OVRCF Overrun/Underrun flag clear Writing 1 to this bit clears the OVR flag in the I2C_ISR register. **/
#define I2C1_I2C_ICR_OVRCF		(1 << 10)
/** I2C1_I2C_ICR_ARLOCF Arbitration Lost flag clear Writing 1 to this bit clears the ARLO flag in the I2C_ISR register. **/
#define I2C1_I2C_ICR_ARLOCF		(1 << 9)
/** I2C1_I2C_ICR_BERRCF Bus error flag clear Writing 1 to this bit clears the BERRF flag in the I2C_ISR register. **/
#define I2C1_I2C_ICR_BERRCF		(1 << 8)
/** I2C1_I2C_ICR_STOPCF Stop detection flag clear Writing 1 to this bit clears the STOPF flag in the I2C_ISR register. **/
#define I2C1_I2C_ICR_STOPCF		(1 << 5)
/** I2C1_I2C_ICR_NACKCF Not Acknowledge flag clear Writing 1 to this bit clears the ACKF flag in I2C_ISR register. **/
#define I2C1_I2C_ICR_NACKCF		(1 << 4)
/** I2C1_I2C_ICR_ADDRCF Address matched flag clear Writing 1 to this bit clears the ADDR flag in the I2C_ISR register. Writing 1 to this bit also clears the START bit in the I2C_CR2 register. **/
#define I2C1_I2C_ICR_ADDRCF		(1 << 3)

/**@}*/

/** @defgroup i2c1_i2c_pecr I2CPECR Access: No wait states
@{*/


#define I2C1_I2C_PECR_PEC_SHIFT		0
#define I2C1_I2C_PECR_PEC_MASK		0xff
/** @defgroup i2c1_i2c_pecr_pec PEC Packet error checking register This field contains the internal PEC when PECEN=1. The PEC is cleared by hardware when PE=0.
@{*/
/**@}*/


/**@}*/

/** @defgroup i2c1_i2c_rxdr I2CRXDR Access: No wait states
@{*/


#define I2C1_I2C_RXDR_RXDATA_SHIFT		0
#define I2C1_I2C_RXDR_RXDATA_MASK		0xff
/** @defgroup i2c1_i2c_rxdr_rxdata RXDATA 8-bit receive data Data byte received from the I2C bus.
@{*/
/**@}*/


/**@}*/

/** @defgroup i2c1_i2c_txdr I2CTXDR Access: No wait states
@{*/


#define I2C1_I2C_TXDR_TXDATA_SHIFT		0
#define I2C1_I2C_TXDR_TXDATA_MASK		0xff
/** @defgroup i2c1_i2c_txdr_txdata TXDATA 8-bit transmit data Data byte to be transmitted to the I2C bus. Note: These bits can be written only when TXE=1.
@{*/
/**@}*/


/**@}*/
